InformationRegisters/DICOMНастройкаСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>DICOMНастройкаСистемы</Name>
			<Comment>Необходимые данные для работы с ТЕКУЩЕЙ системой на выбор, т.е. только с одной, содержит редкоизменяемые необходимые данные - каталоги пути, данные для запросов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AETLRIS_Внутренний</Name>
					<Comment>AET для модальности, отвечающий за работу RIS-части. К примеру, запрос создающий ворклист адресуется к этой модальности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AETLRIS_Внешний</Name>
					<Comment>AET для модальности, отвечающий за работу RIS-части. К примеру, запрос создающий ворклист адресуется к этой модальности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AETLPACS_Внутренний</Name>
					<Comment>AET для модальности, отвечающий за работу PACS-части. К примеру, запрос на получение учения адресуется к этой модальности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AETLPACS_Внешний</Name>
					<Comment>AET для модальности, отвечающий за работу PACS-части. К примеру, запрос на получение учения адресуется к этой модальности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогПутиБатников</Name>
					<Comment>Каталог по которому получается доступ к созданным батникам. Может быть пустым, если система не развертывается</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогКорневогоПутиSQL</Name>
					<Comment>Каталог ведущий к корневой папки установленной системы SQL. Может быть пустым, если для системы оно не требуется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСистемы</Name>
					<Comment>Имя системы, которая настраивается. Позволительно иметь только одну систему активно</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DICOMНастройкаСистемы/Forms/ФормаНастройкиРегистра/Ext/Form/Module.bsl
#Область Справка

//==== Введение ===
 //поскольку Каждая система по работе с DICOM имеет какие-то особенности, кототорые могут быть не очевидны, они (особенности) будут
 //описаны в этой области при помощи комментариев. При формировании какой-то логики работы с этим регистром, НЕОБХОДИМО иметь ввиду
 //как работает сама система, к примеру, для одной реализации может использоваться отдельно имена PACS и RIS AETL, в то время, когда
 //У другой системы используется только общий Хост+Порт, а следовательно необходимо ограничить возможность пользователя всё сломать
 //И писать код интеграции так, что бы разграничить момент обращения к серверу.
 
 
 //==== DCM4CHEE
 //Интеграция dcm4chee-arc-light 5 версии, имеет собственные AETL, по умолчанию - для PACS: DCM4CHEE которая выполняет
 // функции WADO_RS,STOW_RS,QIDO_RS,MWL_RS,MPPS_RS,QIDO_COUNT,DCM4CHEE_ARC_AET
 // Для RIS: WORKLIST выполняет функции UPS_RS,MWL_RS,MPPS_RS,DCM4CHEE_ARC_AET,UPS_MATCHING
 //    
 //Ворклисты можно создать только через WORKLIST, остальное доступно через DCM4CHEE за редким исключением
 //Чтобы корректно создать Worklist (ворклист) НЕОБХОДИМО иметь созданного пациента в dcm4chee
 //
 //Для администрирования системы:
 //    !ВАЖНО!: Проверка, работа и код батников делался под PostgresSQL (далее - PSQL), для других баз необходимы изменения
 //    
 //    ЗАПУСК-ЗАКРЫТИЕ (gracefully) производится при помощи подготовленных bat-файлов, доступ к которым указывается в  КаталогПутиБатников
 //    		Файлы НЕЛЬЗЯ переименовывать (либо надо изменять значения в коде)
 //    ПЕРЕЗАПУСК требует конкретных действий с PSQL и повторного запуска батников, поэтому помимо КаталогПутиБатников
 //    		Необходим - КаталогКорневогоПутиSQL - путь к корневой папке PSQL, которая ИСПОЛЬЗУЕТСЯ для dcm4chee
 //    ПРОВЕРКА ПОДКЛЮЧЕНИЯ требует только наличие комбинации ПОРТ+ХОСТ, для этого используется значение AETL-PACS сервера
		 
		 
		 
 //==== (Первая версия) DICOM Tools (в коде называется DCMTK) 
 // Первая версия, которая работает при помощи DICOM Tools, его настройки хранятся в константах (и там же изменяются)
 // Также данные дублируются в персональных настройках Регистра НастройкиDICOM
 // Версия компоненты DICOM из регистра "ВерсииКомпонентыDICOM" нужна для проверки - нужно ли переустанавливать
 // Или просто устанавливать DICOM Tools. 
 // Заполнение Store-SCP сервера предполагает
 // Заполнение MWL-SCP сервера предполагает
 // Основная информация - каталоги хранения логов и куда скачивается компонента DICOM записываются в соответствующие поля
 // PACS AETL является реально существующим AET PACS сервера
 
 
 
#КонецОбласти 

#Область СтандартныеСобытия

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МенеджерЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Прочитать();	
		
	Если МенеджерЗаписи.ИмяСистемы = "" Тогда
		// Нет записи
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнение настроек не доступно для данного снятого с поддержки функционала. Только изменение уже используемых настроек.");
		Возврат;
	Иначе
		
		ИмяСистемы = МенеджерЗаписи.ИмяСистемы;

		Если ИмяСистемы = "DCMTK" Тогда
			ПрочитатьНастройкиDCMTK();
		ИначеЕсли ИмяСистемы = "DCM4CHEE" Тогда
			ПрочитатьНастройкиDCM4CHEE();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИмяСистемы = "DCM4CHEE" Тогда
		СкрытьВсеЭлементыГруппыКромеУказанного("ГруппаВсехНастроек","DCM4CHEE");
		
	ИначеЕсли ИмяСистемы = "DCMTK" Тогда 
		СкрытьВсеЭлементыГруппыКромеУказанного("ГруппаВсехНастроек","DCMTK");
		// ТОЛЬКО КОРП. Тем, кто переходит со старой на новую!
		Элементы.ИмяСистемы.Видимость = Истина;
		Элементы.ИмяСистемы.СписокВыбора.Добавить("DCM4CHEE","Версия DCM4CHEE");
	Иначе
		// Возможно потом тут можно будет выбрать вариант
		СкрытьВсеЭлементыГруппыКромеУказанного("ГруппаВсехНастроек"); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы И Модифицированность Тогда
		
		Ответ = Вопрос(НСтр("ru = 'Сохранить изменения?';"), РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			СохранитьИзмененияРегистра(Неопределено);
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

// Сохранить изменения насстроек DICOM-системы, в зависимости от системы
//
&НаКлиенте
Процедура СохранитьИзмененияРегистра(Команда)
	                 		
	Если ИмяСистемы = "DCMTK" Тогда
		ЗаписатьНастройкиDCMTK();
	ИначеЕсли ИмяСистемы = "" Тогда
		Возврат;
	КонецЕсли;

	СохранитьИзмененияРегистраСервер();
	ПоказатьОповещениеПользователя(НСтр("ru='Изменения сохранены'"));
    Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияРегистраСервер()

	МенеджерЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.AETLPACS_Внутренний = AETLPACS;
	МенеджерЗаписи.AETLRIS_Внутренний = AETLRIS;
	МенеджерЗаписи.AETLRIS_Внешний = AETLRIS_ВнешнееСоединение;
	МенеджерЗаписи.AETLPACS_Внешний = AETLPACS_ВнешнееСоединение;
	МенеджерЗаписи.ИмяСистемы = ИмяСистемы;
	МенеджерЗаписи.КаталогКорневогоПутиSQL = КаталогКорневогоПутиSQL;
	МенеджерЗаписи.КаталогПутиБатников = КаталогПутиБатников;
	//МенеджерЗаписи.КаталогХраненияВременныхФайлов = КаталогХраненияВременныхФайлов;
			
	МенеджерЗаписи.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура PingСервера(Команда)
	
	Если ИмяСистемы = "DCM4CHEE" Тогда
		
		DCM4CHEEКлиент.ПроверитьПодключениеDCM4CHEE(AETLPACSХост,AETLPACSПорт);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСервер(Команда)
	
	Если ИмяСистемы = "DCM4CHEE" Тогда
		                    
		Если УказанноеПолеНеЗаполнено(КаталогПутиБатников, "КаталогПутиБатников", "Невозможно закрыть сервер без пути к каталогу бат-файлов") Тогда	
			Возврат;		
		КонецЕсли;	
		
		// ТОЛЬКО КОРП
		DCM4CHEEКлиент.ЗакрытьDCM4CHEE(КаталогПутиБатников);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСервер(Команда)
	
	Если ИмяСистемы = "DCM4CHEE" Тогда
		
		Если УказанноеПолеНеЗаполнено(КаталогПутиБатников, "КаталогПутиБатников", "Невозможно запустить сервер без пути") Тогда	
			Возврат;		
		КонецЕсли;
		
		// ТОЛЬКО КОРП
		DCM4CHEEКлиент.ЗапуститьDCM4CHEE(,КаталогПутиБатников, AETLPACSХост, AETLPACSПорт);			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьСервер(Команда)
	
	Если ИмяСистемы = "DCM4CHEE" Тогда
		
		Если УказанноеПолеНеЗаполнено(КаталогКорневогоПутиSQL, "ДирективаКорневогоКаталогаPSQL")
			ИЛИ УказанноеПолеНеЗаполнено(КаталогПутиБатников, "КаталогПутиБатников")
			Тогда	
			Возврат;		
		КонецЕсли;
		
		// ТОЛЬКО КОРП
		DCM4CHEEКлиент.ПерезагрузитьDCM4CHEE(,КаталогКорневогоПутиSQL, КаталогПутиБатников, AETLPACSХост, AETLPACSПорт);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМодальноКаталог(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораКаталогаМодально", ЭтотОбъект, Команда.Имя);

	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	ДиалогОткрытия.Показать(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияФормы

&НаКлиенте
Процедура ИмяСистемыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	                                     
	Если ИмяСистемы = "DCM4CHEE" Тогда
		ПрочитатьНастройкиDCM4CHEE();
		ИмяСистемы = "DCM4CHEE";
		СкрытьВсеЭлементыГруппыКромеУказанного("ГруппаВсехНастроек","DCM4CHEE");
		
	ИначеЕсли ИмяСистемы = "DCMTK" Тогда 
		ПрочитатьНастройкиDCMTK();
		СкрытьВсеЭлементыГруппыКромеУказанного("ГруппаВсехНастроек","DCMTK");
		
	Иначе
		СкрытьВсеЭлементыГруппыКромеУказанного("ГруппаВсехНастроек");
	КонецЕсли;
		
КонецПроцедуры

#Область События_DCMTK

// Проверяем, что DCMTK значения не отличаются от константных
//
&НаКлиенте
Процедура DCMTK_КонстантныеЗначенияПриИзменении(Элемент)
	ПроверитьУстановитьМодифицированностьЭлементаDCMTK(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура DCMTK_КаталогЗапускаСлужбНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыборКаталога(НСтр("ru='Выберите каталог запуска служб'"), DCMTK_КаталогЗапускаСлужб);
КонецПроцедуры

&НаКлиенте
Процедура DCMTK_LogCatalogНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыборКаталога(НСтр("ru='Выберите каталог логов работы служб'"), DCMTK_LogCatalog);
КонецПроцедуры

&НаКлиенте
Процедура DCMTK_MWLSCP_КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыборКаталога(НСтр("ru='Выберите каталог файлов worklist-ов'"), DCMTK_MWLSCP_КаталогФайлов);
КонецПроцедуры

&НаКлиенте
Процедура DCMTK_STORESCP_КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыборКаталога(НСтр("ru='Выберите каталог файлов с результатами'"), DCMTK_STORESCP_КаталогФайлов);
КонецПроцедуры

#КонецОбласти

#Область СобытияDCM4CHEE

&НаКлиенте
Процедура КаталогПутиБатниковНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыборКаталога(НСтр("ru='Выберите каталог bat-файлов'"), КаталогПутиБатников);
КонецПроцедуры

&НаКлиенте
Процедура ДирективаКорневогоКаталогаPSQLНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыборКаталога(НСтр("ru='Выберите корневой каталог PostgresQL или другой SQL'"), КаталогКорневогоПутиSQL);
КонецПроцедуры                                                    

&НаКлиенте
Процедура AETLМенеджераПриИзменении(Элемент)
	
	AETLPACSПорт = Формат(ДопСерверныеФункции.ПолучитьРеквизит(AETLPACS,"Port"),"ЧГ=");
	AETLPACSХост = ДопСерверныеФункции.ПолучитьРеквизит(AETLPACS,"Host");
    Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура AETLЛистовПриИзменении(Элемент)
	
	AETLRISПорт = Формат(ДопСерверныеФункции.ПолучитьРеквизит(AETLRIS,"Port"),"ЧГ=");
	AETLRISХост = ДопСерверныеФункции.ПолучитьРеквизит(AETLRIS,"Host");
    Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДоступностиИСуществованияКаталога(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	Файл = Новый Файл(Текст);
	          
	Если НЕ Файл.Существует()
		ИЛИ НЕ Файл.ЭтоКаталог()
		//ИЛИ Файл.ПолучитьТолькоЧтение()
		Тогда
		
			СтандартнаяОбработка = Ложь;
			Предупреждение(НСтр("ru = 'Каталог не существует или не доступен'; en = 'Directory is unaccessible or non-existent!'"));		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти



////// ====================================

#Область РаботаСистемыDCMTK
// Старая реализация - при помощи инструментов внешних

&НаСервере
Процедура ПроверитьУстановитьМодифицированностьЭлементаDCMTK(ЭлементФормы)
	
	ИмяРеквизитаФормы	= Элементы[ЭлементФормы].Имя;
	ЗначениеВБазе	= Константы[ИмяРеквизитаФормы].Получить();
	ТекущееЗначение = ЭтаФорма[Элементы[ЭлементФормы].ПутьКДанным];
	Если ТекущееЗначение <> ЗначениеВБазе Тогда
		Модифицированность = Истина;	
	КонецЕсли;
	
КонецПроцедуры 

// Считываем константы для страницы DCMTK - legacy реализация
//
&НаСервере
Процедура ПрочитатьНастройкиDCMTK()
	
	DCMTK_КаталогЗапускаСлужб				= Константы.DCMTK_КаталогЗапускаСлужб		.Получить();
	DCMTK_LogCatalog       					= Константы.DCMTK_LogCatalog				.Получить();
	DCMTK_ЗапросыВызываемыйAETitle			= Константы.DCMTK_ЗапросыВызываемыйAETitle	.Получить();
	DCMTK_STORESCP_КаталогФайлов			= Константы.DCMTK_STORESCP_КаталогФайлов			.Получить();
	DCMTK_STORESCP_ИспользуемыйAETitle		= Константы.DCMTK_STORESCP_ИспользуемыйAETitle	.Получить();
	DCMTK_STORESCP_АвтоматическийЗапуск		= Константы.DCMTK_STORESCP_АвтоматическийЗапуск	.Получить();
	DCMTK_MWLSCP_КаталогФайлов				= Константы.DCMTK_MWLSCP_КаталогФайлов			.Получить();
	DCMTK_MWLSCP_ИспользуемыйAETitle		= Константы.DCMTK_MWLSCP_ИспользуемыйAETitle		.Получить();
	DCMTK_MWLSCP_АвтоматическийЗапуск		= Константы.DCMTK_MWLSCP_АвтоматическийЗапуск		.Получить();	
	
КонецПроцедуры

// Записываем константы из данных страницы DCMTK - legacy реализация
//
&НаСервере
Процедура ЗаписатьНастройкиDCMTK()
	
	Константы.DCMTK_КаталогЗапускаСлужб		.Установить(DCMTK_КаталогЗапускаСлужб);
	Константы.DCMTK_LogCatalog				.Установить(DCMTK_LogCatalog);
	Константы.DCMTK_ЗапросыВызываемыйAETitle.Установить(DCMTK_ЗапросыВызываемыйAETitle);
	Константы.DCMTK_STORESCP_КаталогФайлов		.Установить(DCMTK_STORESCP_КаталогФайлов);
	Константы.DCMTK_STORESCP_ИспользуемыйAETitle	.Установить(DCMTK_STORESCP_ИспользуемыйAETitle);
	Константы.DCMTK_STORESCP_АвтоматическийЗапуск	.Установить(DCMTK_STORESCP_АвтоматическийЗапуск);
	Константы.DCMTK_MWLSCP_КаталогФайлов			.Установить(DCMTK_MWLSCP_КаталогФайлов);
	Константы.DCMTK_MWLSCP_ИспользуемыйAETitle	.Установить(DCMTK_MWLSCP_ИспользуемыйAETitle);
	Константы.DCMTK_MWLSCP_АвтоматическийЗапуск	.Установить(DCMTK_MWLSCP_АвтоматическийЗапуск);	   
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСистемыDCM4CHEE
// То что необходимо делать здесь, а не в общем модуле DCM4CHEEКлиент
// ТОЛЬКО КОРП
&НаСервере
Процедура ПрочитатьНастройкиDCM4CHEE()
	
	МенеджерЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Прочитать();
	
	// Заполним основное
	AETLPACS = МенеджерЗаписи.AETLPACS_Внутренний; 
	AETLPACS_ВнешнееСоединение = МенеджерЗаписи.AETLPACS_Внешний;
	AETLPACSПорт = Формат(МенеджерЗаписи.AETLPACS_Внутренний.Port,"ЧГ=");
	AETLPACSХост = МенеджерЗаписи.AETLPACS_Внутренний.Host;
	
	AETLRIS = МенеджерЗаписи.AETLRIS_Внутренний;
	AETLRIS_ВнешнееСоединение = МенеджерЗаписи.AETLRIS_Внешний;
	AETLRISПорт = Формат(МенеджерЗаписи.AETLRIS_Внутренний.Port,"ЧГ=");
	AETLRISХост = МенеджерЗаписи.AETLRIS_Внутренний.Host;
	
	ИмяСистемы = МенеджерЗаписи.ИмяСистемы;
	КаталогКорневогоПутиSQL = МенеджерЗаписи.КаталогКорневогоПутиSQL;
	КаталогПутиБатников = МенеджерЗаписи.КаталогПутиБатников;

КонецПроцедуры


#КонецОбласти 

#Область РаботаДругойСистемы
// Ещё не поддерживающаяся система - Подумать над реализацией, чтоб пользователь сам вбивал данные?
// Либо переделать на Orthanc
	
#КонецОбласти

#Область ПрочиеФункцииИПроцедуры

&НаКлиенте
Процедура ВыборКаталога(Заголовок, ПеременнаяПуть)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = Заголовок;
	ДиалогОткрытияФайла.Каталог = ПеременнаяПуть;
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПеременнаяПуть = ДиалогОткрытияФайла.Каталог;
		Модифицированность = Истина;
	Иначе
		Предупреждение(НСтр("ru = 'Каталог не выбран'; en = 'Directory not selected!'"));
	КонецЕсли;
		
КонецПроцедуры

// Функция - Проверка заполнения Поля формы, передаваемого в функцию
//
// Параметры:
//  Значение			 - Произвольное	 - Значение, которое необходимо проверить
//  СтрПолеЗначения		 - Строка	 -  Поле, которое должен на форме заполнить пользователь
//  НестандартныйТекст	 - Строка	 -  Сообщение, которое будет показано пользователю
// 
// Возвращаемое значение:
//  Булево - Истина, если НЕ заполнена
//
&НаКлиенте
Функция УказанноеПолеНеЗаполнено(Значение, СтрПолеЗначения = Неопределено, НестандартныйТекст = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(НестандартныйТекст = Неопределено,"необходимо заполнить это значение!", НестандартныйТекст),
						Неопределено, СтрПолеЗначения,);
		
		//// Сообщение некрасиво вываливаются из-за того, что данные находятся в группе "страницы"
		//Сообщение = Новый СообщениеПользователю();
		//Сообщение.Поле  = СтрПолеЗначения; 
		//Сообщение.Текст = ?(НестандартныйТекст = Неопределено,"необходимо заполнить это значение!", НестандартныйТекст); 
		//Сообщение.Сообщить();
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;		
	
КонецФункции

// Проверить существование каталога по его пути
//
// Параметры:
//  ПутьКаталога  - Строка - Строка полного пути к каталогу
//
// Возвращаемое значение:
//   Булево   - существует ли файл или нет
//
&НаКлиенте
Функция КаталогСуществует(ПутьКаталога)

	КаталогНаДиске = Новый Файл(ПутьКаталога);
    Возврат КаталогНаДиске.Существует();

КонецФункции 
	
// Процедура обходит все элементы внутри группы на форме, после чего ставит видимым указанный элемент
//
// Параметры:
//  ГруппаНаОбход  - Строка - Имя группы формы, элементы которой необходимо скрыть
//  ИмяЭлемента  - Строка - Имя элемента, который должен быть видимым
//
&НаКлиенте
Процедура СкрытьВсеЭлементыГруппыКромеУказанного(ГруппаНаОбход, ИмяЭлемента = Неопределено)

	Для каждого ЭлементГруппы из Элементы[ГруппаНаОбход].ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(ЭлементГруппы) = Тип("ДекорацияФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементГруппы.Видимость = Ложь; 
		
	КонецЦикла;	
	
	Если ИмяЭлемента <> Неопределено Тогда	
		Элементы[ИмяЭлемента].Видимость = Истина; 
		Элементы[ИмяЭлемента].Доступность = Истина;  
		Элементы[ИмяЭлемента].ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
